renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_sci.c
    transfer_busy = true;
    ret_drv = R_SCI_Send(sci_handle, p_memdrv_info->p_data, p_memdrv_info->cnt);
    if (SCI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    
    /* Wait for transmission completion. */
    if (0 > r_memdrv_sci_wait(channel, p_memdrv_info->cnt))
    {
        /* ---- Disable SCI transmission. ---- */
        if (SCI_SUCCESS != R_SCI_Close(sci_handle))
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
    }
    
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_sci_tx() */

/************************************************************************************************
* Function Name: r_memdrv_sci_tx_data
* Description  : Transmits data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_sci_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    sci_err_t   ret_drv = SCI_SUCCESS;
    uint8_t     channel = r_memdrv_get_drv_ch(devno);
    uint32_t    cnt     = p_memdrv_info->cnt;
    uint32_t    rem_txcnt = cnt / SCI_EXCHG_MAX_COUNT;
    uint32_t    mod_txcnt = cnt % SCI_EXCHG_MAX_COUNT;

    transfer_busy = true;
    /* Turn 32 digits into 16 digits */
    if (rem_txcnt >= 1)
    {
        /* WAIT_LOOP */
        while(rem_txcnt)
        {
            ret_drv = R_SCI_Send(sci_handle, p_memdrv_info->p_data, SCI_EXCHG_MAX_COUNT);
            if (MEMDRV_SUCCESS != ret_drv)
            {
                return MEMDRV_ERR_OTHER;
            }
            p_memdrv_info->p_data = (uint8_t *)(p_memdrv_info->p_data + SCI_EXCHG_MAX_COUNT);
            rem_txcnt--;
        }
        ret_drv = R_SCI_Send(sci_handle, p_memdrv_info->p_data, mod_txcnt);
    }
    else
    {
        ret_drv = R_SCI_Send(sci_handle, p_memdrv_info->p_data, cnt);
    }

    if (SCI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    
    /* Wait for transmission completion. */
    if (0 > r_memdrv_sci_wait(channel, p_memdrv_info->cnt))
    {
        /* ---- Disable SCI transmission. ---- */
        if (SCI_SUCCESS != R_SCI_Close(sci_handle))
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
    }
    
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_sci_tx_data() */

/************************************************************************************************
* Function Name: r_memdrv_sci_rx
* Description  : Receives data for status register and Read ID.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_sci_rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    sci_err_t   ret_drv = SCI_SUCCESS;
    uint8_t channel = r_memdrv_get_drv_ch(devno);
    
    transfer_busy = true;
    ret_drv = R_SCI_Receive(sci_handle, p_memdrv_info->p_data, p_memdrv_info->cnt);
    if (SCI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }
    
    /* Wait for transmission completion. */
    if (0 > r_memdrv_sci_wait(channel, p_memdrv_info->cnt))
    {
        /* ---- Disable SCI transmission. ---- */
        if (SCI_SUCCESS != R_SCI_Close(sci_handle))
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
    }
    
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_sci_rx() */

/************************************************************************************************
* Function Name: r_memdrv_sci_rx_data
* Description  : Receives data using the single mode.
* Arguments    : uint8_t         devno                  ;   Device No. (MEMDRV_DEVn)
*              : st_memdrv_info_t * p_memdrv_info
*              :    uint32_t    cnt                     ;   Number of bytes
*              :    uint8_t   * p_data                  ;   Buffer pointer
*              :    uint8_t     io_mode                 ;   Single/Dual/Quad
*              :    uint8_t     rsv[3]                  ;   Reserved
* Return Value : MEMDRV_SUCCESS                         ;   Successful operation
*              : MEMDRV_ERR_HARD                        ;   Hardware error
*              : MEMDRV_ERR_OTHER                       ;   Other error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
memdrv_err_t r_memdrv_sci_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    sci_err_t   ret_drv = SCI_SUCCESS;
    uint8_t     channel = r_memdrv_get_drv_ch(devno);
    uint32_t    cnt     = p_memdrv_info->cnt;
    uint32_t    rem_rxcnt = cnt / SCI_EXCHG_MAX_COUNT;
    uint32_t    mod_rxcnt = cnt % SCI_EXCHG_MAX_COUNT;
    
