renesas/rx72n-envision-kit/projects/renesas/vendors/renesas/rx_driver_package/v125/r_memdrv_rx/src/r_memdrv_sci.c
    transfer_busy = true;
    /* Turn 32 digits into 16 digits */
    if (rem_rxcnt >= 1)
    {
        /* WAIT_LOOP */
        while(rem_rxcnt)
        {
            ret_drv = R_SCI_Receive(sci_handle, p_memdrv_info->p_data, SCI_EXCHG_MAX_COUNT);
            if (MEMDRV_SUCCESS != ret_drv)
            {
                return MEMDRV_ERR_OTHER;
            }
            p_memdrv_info->p_data = (uint8_t *)(p_memdrv_info->p_data + SCI_EXCHG_MAX_COUNT);
            rem_rxcnt--;
        }
        ret_drv = R_SCI_Receive(sci_handle, p_memdrv_info->p_data, mod_rxcnt);
    }
    else
    {
        ret_drv = R_SCI_Receive(sci_handle, p_memdrv_info->p_data, cnt);
    }
    if (SCI_SUCCESS != ret_drv)
    {
        R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
        return MEMDRV_ERR_OTHER;
    }

    /* Wait for transmission completion. */
    if (0 > r_memdrv_sci_wait(channel, p_memdrv_info->cnt))
    {
        /* ---- Disable SCI transmission. ---- */
        if (SCI_SUCCESS != R_SCI_Close(sci_handle))
        {
            R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
            return MEMDRV_ERR_OTHER;
        }
    }
    
    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_sci_rx_data() */

/*******************************************************************************
* Function Name: r_memdrv_sci_1ms_interval
* Description  : 1ms Interval Timer call function.
* Arguments    : none
* Return Value : none
*******************************************************************************/
memdrv_err_t r_memdrv_sci_1ms_interval(void)
{
    uint8_t channel = 0;
    /* WAIT_LOOP */
    for (channel = 0; channel < SCI_MAX_CHANNELS; channel++)
    {
        if (memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_FLG] != 0)
        {
            memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_COUNT]++;
        }
    }

    return MEMDRV_SUCCESS;
} /* End of function r_memdrv_sci_1ms_interval() */

/*******************************************************************************
* Function Name: r_memdrv_sci_start_timer
* Description  : Sets timer for checking timeout and start timer.
* Arguments    : channel -
*                    Which channel to use
*              : msec -
*                    timeout(msec order)
* Return Value : none
*******************************************************************************/
static void r_memdrv_sci_start_timer(uint8_t channel, uint32_t msec)
{
    memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_FLG] = 1;
    memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_COUNT] = 0;
    memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_MAX_COUNT] = (uint32_t)(msec);
} /* End of function r_memdrv_sci_start_timer() */

/*******************************************************************************
* Function Name: r_memdrv_sci_check_timer
* Description  : Checks timeout to set r_memdrv_sci_start_timer function.
*              : If timeout,return MEMDRV_ERR_HARD. 
*              : In the case of others, return MEMDRV_SUCCESS.
* Arguments    : channel -
*                    Which channel to use
* Return Value : MEMDRV_SUCCESS -
*                    Successful operation
*                MEMDRV_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static memdrv_err_t r_memdrv_sci_check_timer(uint8_t channel)
{
    memdrv_err_t ret = MEMDRV_SUCCESS;
    uint32_t memdrv_sci_timer_cnt_out1 = memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_COUNT];
    uint32_t memdrv_sci_timer_cnt_out2 = memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_MAX_COUNT];

    /* ---- Check compare ---- */
    if (memdrv_sci_timer_cnt_out1 >= memdrv_sci_timer_cnt_out2)
    {
        ret = MEMDRV_ERR_HARD;
    }
    else
    {
        ret = MEMDRV_SUCCESS;
    }

    return ret;
} /* End of function r_memdrv_sci_check_timer() */

/*******************************************************************************
* Function Name: r_memdrv_sci_end_timer
* Description  : Stops timer to set r_memdrv_sci_start_timer function.
* Arguments    : channel -
*                    Which channel to use
* Return Value : none
*******************************************************************************/
static void r_memdrv_sci_end_timer(uint8_t channel)
{
    memdrv_sci_timer_cnt_out[channel][SCI_TIMER_CH_FLG] = 0;
} /* End of function r_memdrv_sci_end_timer() */

/*******************************************************************************
* Function Name: r_memdrv_sci_wait
* Description  : Waits for reception completion.
* Arguments    : channel -
*                    Which channel to use
*                size -
*                    Size of data
* Return Value : MEMDRV_SUCCESS -
*                    Successful operation
*                MEMDRV_ERR_HARD -
*                    Hardware error
*******************************************************************************/
static memdrv_err_t r_memdrv_sci_wait(uint8_t channel, uint32_t size)
{
    memdrv_err_t    ret  = MEMDRV_SUCCESS;
    uint32_t               time = SCI_TIMER_MIN_TIME;     // 100ms        

    /* ---- Check DMAC/DTC transfer end.  --- */
    /* Timeout value depends on transfer size. 
       Minimum time is 100ms. When the data count exceeds 10 sectors (1 sector = 512 bytes),
       increase 10ms time for 1 sector increase.*/
    if ((SCI_SECTOR_SIZE * 10) < size)
    {
        time = (time + (((size / SCI_SECTOR_SIZE) - 10) * 10));
        if (0x0fffffff < time)
        {
            time = 0x0fffffff;
        }
    }

    /* Start timer. */
    r_memdrv_sci_start_timer(channel, time);
    /* WAIT_LOOP */
    while (1)
    {
        /* Check timeout. */
        if (MEMDRV_ERR_HARD == r_memdrv_sci_check_timer(channel))
        {
            ret = MEMDRV_ERR_HARD;
            break;
        }
        if (false == transfer_busy)
        {
            break;
        }
    }

    r_memdrv_sci_end_timer(channel);

    return ret;
} /* End of function r_memdrv_sci_wait() */

/*****************************************************************************
* Function Name: r_memdrv_sci_callback
* Description  : This is an example of an SCI callback function.
* Arguments    : p_data - pointer to SCI event code data.
* Return Value : None
******************************************************************************/
static void r_memdrv_sci_callback(void *p_data)
{
    transfer_busy = false;
} /* End of function r_memdrv_SCI_callback() */

/*****************************************************************************
* Function Name: sci_init_ports
* Description  : This function initializes the port pins associated with
*                SCI channel 6 using the macros defined in iodefine.h.
* Arguments    : None
* Return Value : None
******************************************************************************/
static void sci_init_ports(void)
{
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH0)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH0)))
    R_SCI_PinSet_SCI0();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH1)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH1)))
    R_SCI_PinSet_SCI1();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH2)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH2)))
    R_SCI_PinSet_SCI2();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH3)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH3)))
    R_SCI_PinSet_SCI3();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH4)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH4)))
    R_SCI_PinSet_SCI4();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH5)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH5)))
    R_SCI_PinSet_SCI5();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH6)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH6)))
    R_SCI_PinSet_SCI6();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH7)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH7)))
    R_SCI_PinSet_SCI7();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH8)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH8)))
    R_SCI_PinSet_SCI8();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH9)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)      && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH9)))
    R_SCI_PinSet_SCI9();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH10)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)     && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH10)))
    R_SCI_PinSet_SCI10();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH11)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)     && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH11)))
    R_SCI_PinSet_SCI11();
#endif
#if (((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && \
      (MEMDRV_CFG_DEV0_MODE_DRVR_CH == MEMDRV_DRVR_CH12)) || ((MEMDRV_CFG_DEV1_INCLUDED == 1)     && \
      (MEMDRV_CFG_DEV1_MODE_DRVR & MEMDRV_DRVR_RX_FIT_SCI_SPI) && (MEMDRV_CFG_DEV1_MODE_DRVR_CH == MEMDRV_DRVR_CH12)))
    R_SCI_PinSet_SCI12();
#endif
} /* End of function sci_init_ports() */

#else
memdrv_err_t r_memdrv_sci_open(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_open() */
memdrv_err_t r_memdrv_sci_close(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_close() */
memdrv_err_t r_memdrv_sci_disable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_disable() */
memdrv_err_t r_memdrv_sci_disable_tx_data(uint8_t devno,
                                          st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_disable_tx_data() */
memdrv_err_t r_memdrv_sci_disable_rx_data(uint8_t devno,
                                          st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_disable_rx_data() */
memdrv_err_t r_memdrv_sci_enable(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_enable() */
memdrv_err_t r_memdrv_sci_enable_tx_data(uint8_t devno,
                                         st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_enable_tx_data() */
memdrv_err_t r_memdrv_sci_enable_rx_data(uint8_t devno,
                                         st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_enable_rx_data() */
memdrv_err_t r_memdrv_sci_tx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_tx() */
memdrv_err_t r_memdrv_sci_tx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_tx_data() */
memdrv_err_t r_memdrv_sci_rx(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_rx() */
memdrv_err_t r_memdrv_sci_rx_data(uint8_t devno, st_memdrv_info_t * p_memdrv_info)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_rx_data() */
memdrv_err_t r_memdrv_sci_1ms_interval(void)
{
    R_MEMDRV_Log(MEMDRV_DEBUG_ERR_ID, (uint32_t)MEMDRV_ERR_SUB, __LINE__);
    return MEMDRV_ERR_OTHER;
} /* End of function r_memdrv_sci_1ms_interval() */
#endif  /* ((MEMDRV_CFG_DEV0_INCLUDED == 1) && (MEMDRV_CFG_DEV0_MODE_DRVR == MEMDRV_DRVR_RX_FIT_SCI_SPI)) || \
           ((MEMDRV_CFG_DEV1_INCLUDED == 1) && (MEMDRV_CFG_DEV1_MODE_DRVR == MEMDRV_DRVR_RX_FIT_SCI_SPI))

/* End of File */
